xihua13104/bluekitchen/port/stm32-f4discovery-csr8x11/exception_handler/src/exception_handler.c
/* Includes ------------------------------------------------------------------*/
//#include "memory_attribute.h"
//#include "exception_config.h"
#include "exception_handler.h"
// #include "exception_portable.h"
// #include "hal_dwt.h"
// #include "hal_uart.h"
// #include "hal_gpt.h"
// #include "hal_pmu.h"
#include "stm32f4xx_hal.h"
#include "core_cm4.h"

#ifdef HAL_WDT_MODULE_ENABLED
#include "hal_wdt.h"
#endif

// #ifdef MTK_SYSTEM_HANG_TRACER_ENABLE
// #include "systemhang_tracer.h"
// #endif /* MTK_SYSTEM_HANG_TRACER_ENABLE */

// #ifdef MTK_MEMORY_MONITOR_ENABLE
// #include "memory_monitor.h"
// #endif /* MTK_MEMORY_MONITOR_ENABLE */

#ifdef MTK_BOOTREASON_CHECK_ENABLE
#include "bootreason_check.h"
#endif /* MTK_BOOTREASON_CHECK_ENABLE */

/* Private define ------------------------------------------------------------*/
#if  defined ( __GNUC__ )
#ifndef __weak
#define __weak   __attribute__((weak))
#endif /* __weak */
#endif /* __GNUC__ */

#define EXCEPTION_CONFIGURATIONS_MAX                    6

#define EXCEPTION_STACK_WORDS                           768

/* Private typedef -----------------------------------------------------------*/
typedef enum {
    EXCEPTION_RESET     = 1,
    EXCEPTION_NMI       = 2,
    EXCEPTION_HARD_FAULT = 3,
    EXCEPTION_MEMMANAGE_FAULT = 4,
    EXCEPTION_BUS_FAULT = 5,
    EXCEPTION_USAGE_FAULT = 6,
    EXCEPTION_DEBUGMON_FAULT = 12,
} exception_type_t;

typedef struct {
    int items;
    exception_config_type configs[EXCEPTION_CONFIGURATIONS_MAX];
} exception_config_t;

typedef struct {
    uint32_t items;
    memory_region_type regions[EXCEPTION_CONFIGURATIONS_MAX];
} exception_user_regions_t;

typedef struct {
    uint32_t count;
    uint32_t timestamp;
    uint32_t timestamp_32k;
    uint32_t reason;
    assert_expr_t *assert_expr;
} exception_info_t;

enum { r0, r1, r2, r3, r12, lr, pc, psr,
       s0, s1, s2, s3, s4, s5, s6, s7,
       s8, s9, s10, s11, s12, s13, s14, s15,
       fpscr
     };

typedef struct {
    unsigned int r0;
    unsigned int r1;
    unsigned int r2;
    unsigned int r3;
    unsigned int r4;
    unsigned int r5;
    unsigned int r6;
    unsigned int r7;
    unsigned int r8;
    unsigned int r9;
    unsigned int r10;
    unsigned int r11;
    unsigned int r12;
    unsigned int sp;              /* after pop r0-r3, lr, pc, xpsr                   */
    unsigned int lr;              /* lr before exception                             */
    unsigned int pc;              /* pc before exception                             */
    unsigned int psr;             /* xpsr before exeption                            */
    unsigned int control;         /* nPRIV bit & FPCA bit meaningful, SPSEL bit = 0  */
    unsigned int exc_return;      /* current lr                                      */
    unsigned int msp;             /* msp                                             */
    unsigned int psp;             /* psp                                             */
    unsigned int basepri;         /* basepri                                         */
    unsigned int primask;         /* primask                                         */
    unsigned int faultmask;       /* faultmask                                       */
    unsigned int fpscr;
    unsigned int s0;
    unsigned int s1;
    unsigned int s2;
    unsigned int s3;
    unsigned int s4;
    unsigned int s5;
    unsigned int s6;
    unsigned int s7;
    unsigned int s8;
    unsigned int s9;
    unsigned int s10;
    unsigned int s11;
    unsigned int s12;
    unsigned int s13;
    unsigned int s14;
    unsigned int s15;
    unsigned int s16;
    unsigned int s17;
    unsigned int s18;
    unsigned int s19;
    unsigned int s20;
    unsigned int s21;
    unsigned int s22;
    unsigned int s23;
    unsigned int s24;
    unsigned int s25;
    unsigned int s26;
    unsigned int s27;
    unsigned int s28;
    unsigned int s29;
    unsigned int s30;
    unsigned int s31;
} exception_context_t;

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* exception handler's stack */
static unsigned int exception_stack[EXCEPTION_STACK_WORDS] = {0};
unsigned int *exception_stack_pointer = &exception_stack[EXCEPTION_STACK_WORDS - 1];

/* exception user configuration area */
static exception_config_t exception_config = {0};

/* avoid other global value corrupt exception_user_regions */
static exception_user_regions_t exception_user_regions;

/* exception reboot configuration area */
static int reboot_flag = 0;

/* assert information area */
static assert_expr_t assert_expr = {0};
static const char *assert_string = "CM4 assert : %s, file: %s, line: %d\r\n";

/* exception information area */
static exception_info_t exception_info = {0};
exception_info_t *exception_info_pointer = &exception_info;

/* exception context area */
exception_context_t exception_context = {0};
exception_context_t *exception_context_pointer = &exception_context;

static uint32_t primask_backup_assert = 0;

static uint32_t exception_wdt_mode = 0;

#ifdef MTK_BOOTREASON_CHECK_ENABLE
    static uint32_t ram_assert_flag = 0;
#endif /* MTK_BOOTREASON_CHECK_ENABLE */

static uint32_t double_assert_flag = 0;
static uint32_t double_assert_lr = 0;

volatile exception_config_mode_t exception_config_mode = {EXCEPTION_MEMDUMP_TEXT};

/******************************************************************************/
/*            Memory Regions Definition                                       */
/******************************************************************************/
#if defined(__GNUC__)
extern unsigned int _sdata[];
extern unsigned int _edata[];
const memory_region_type memory_regions[] = {
    {"ram", _sdata, _edata, 1},
    {0}
};
#endif /* __GNUC__ */

/* Private functions ---------------------------------------------------------*/
/******************************************************************************/
/*            Exception's wdt timeout Functions                               */
/******************************************************************************/
void exception_feed_wdt(void)
{
#ifdef HAL_WDT_MODULE_ENABLED
#endif
}

void exception_enable_wdt_reset(void)
{
#ifdef HAL_WDT_MODULE_ENABLED
#endif
    exception_wdt_mode = EXCEPTION_WDT_RESET;
}

void exception_disable_wdt_reset(void)
{
#ifdef HAL_WDT_MODULE_ENABLED
#endif
}

void exception_enable_wdt_interrupt(void)
{
    if ((exception_wdt_mode != EXCEPTION_WDT_INTERRUPT) && (exception_info.reason != EXCEPTION_NMI)) {
        exception_wdt_mode = EXCEPTION_WDT_INTERRUPT;
    }
}

/******************************************************************************/
/*            Exception's assert Functions                                    */
/******************************************************************************/
void abort(void)
{
    static uint32_t primask_backup_abort = 0;

