xihua13104/bluekitchen/port/stm32-f4discovery-csr8x11/exception_handler/src/exception_handler.c
    primask_backup_abort = __get_PRIMASK();
    __disable_irq();

    SCB->CCR |=  SCB_CCR_UNALIGN_TRP_Msk;
    *((volatile unsigned int *) 0xFFFFFFF1) = 1;
    for (;;);

    /* Just to avoid compiler warnings. */
    (void) primask_backup_abort;
}

//extern  hal_core_status_t hal_core_status_read(hal_core_id_t id);
void platform_assert(const char *expr, const char *file, int line)
{
    // if (HAL_CORE_EXCEPTION == hal_core_status_read(HAL_CORE_CM4)){
    //     exception_printf("[Warning]:cannot assert in exception flow!!!\r\n");
    //     return;
    // }

    primask_backup_assert = __get_PRIMASK();
    __disable_irq();

#ifdef MTK_BOOTREASON_CHECK_ENABLE
    bootreason_set_flag_assert_reset();
#endif /* MTK_BOOTREASON_CHECK_ENABLE */

    SCB->CCR |=  SCB_CCR_UNALIGN_TRP_Msk;
    assert_expr.is_valid = 1;
    assert_expr.expr = expr;
    assert_expr.file = file;
    assert_expr.line = line;
    *((volatile unsigned int *) 0xFFFFFFF1) = 1;

    while(1);

    /* Just to avoid compiler warnings. */
    (void) primask_backup_assert;
}

// #if (PRODUCT_VERSION != 1552) && (PRODUCT_VERSION != 2552)
void light_assert(const char *expr, const char *file, int line)
{
    static uint32_t primask_backup_assert = 0;

    // if (HAL_CORE_EXCEPTION == hal_core_status_read(HAL_CORE_CM4)){
    //     exception_printf("[Warning]:cannot assert in exception flow!!!\r\n");
    //     return;
    // }

    primask_backup_assert = __get_PRIMASK();
    __disable_irq();

#ifdef MTK_BOOTREASON_CHECK_ENABLE
    bootreason_set_flag_assert_reset();
#endif /* MTK_BOOTREASON_CHECK_ENABLE */

    SCB->CCR |=  SCB_CCR_UNALIGN_TRP_Msk;
    assert_expr.is_valid = 2;
    assert_expr.expr = expr;
    assert_expr.file = file;
    assert_expr.line = line;
    assert_expr.string = assert_string;
    *((volatile unsigned int *) 0xFFFFFFF1) = 1;
     while(1);

    /* Just to avoid compiler warnings. */
    (void) primask_backup_assert;
}
// #endif /* (PRODUCT_VERSION != 1552) && (PRODUCT_VERSION != 2552) */

void __ram_assert(const char *expr, const char *file, int line)
{
	char exp[] = "RAM_Assert";

    // if (HAL_CORE_EXCEPTION == hal_core_status_read(HAL_CORE_CM4)){
    //     double_assert_flag = TRUE;
    //     double_assert_lr = (uint32_t)__builtin_return_address(0);
    //     return;
    // }

    primask_backup_assert = __get_PRIMASK();
    __disable_irq();

#ifdef MTK_BOOTREASON_CHECK_ENABLE
    ram_assert_flag = TRUE;
#endif /* MTK_BOOTREASON_CHECK_ENABLE */

    SCB->CCR |=  SCB_CCR_UNALIGN_TRP_Msk;
    assert_expr.is_valid = 1;
    assert_expr.expr = exp;
    assert_expr.file = file;
    assert_expr.line = line;
    *((volatile unsigned int *) 0xFFFFFFF1) = 1;

    while(1);
    /* Just to avoid compiler warnings. */
    (void) primask_backup_assert;
}

#if defined (__CC_ARM) || defined (__ICCARM__)
void __aeabi_assert(const char *expr, const char *file, int line)
{
    platform_assert(expr, file, line);
}
#endif /* __CC_ARM */

void exception_get_assert_expr(const char **expr, const char **file, int *line)
{
    if (assert_expr.is_valid) {
        *expr = assert_expr.expr;
        *file = assert_expr.file;
        *line = assert_expr.line;
    } else {
        *expr = NULL;
        *file = NULL;
        *line = 0;
    }
}

void exception_print_assert_info(void)
{
    if (assert_expr.is_valid == 1) {
        exception_printf("CM4 assert failed: %s, file: %s, line: %d\r\n",
                         assert_expr.expr,
                         assert_expr.file,
                         (int)assert_expr.line);
    } else if (assert_expr.is_valid == 2) {
        // exception_msgid(EXCEPTION_CPU_ID_MASTER,
        //                 assert_expr.string,
        //                 3,
        //                 assert_expr.expr,
        //                 assert_expr.file,
        //                 (int)assert_expr.line);
    }
}

/******************************************************************************/
/*            Exception's Reboot Functions                                    */
/******************************************************************************/
__weak void exception_reboot(void)
{
    /* It is defined as a weak function.
     * It needs to be implemented in project.
     */
#ifdef HAL_WDT_MODULE_ENABLED
    /* In exception flow,uart mode is polling,so it's no need to wait for 3s */
    hal_wdt_software_reset();
    while (1);
#endif
    return;
}

void exception_dump_config(int flag)
{
    reboot_flag = flag;
}

static int reboot_check(void)
{
    return reboot_flag;
}

/******************************************************************************/
/*            Exception's Dump Mode Functions                        */
/******************************************************************************/
int exception_dump_config_init(void)
{
    return 0;
}

void exception_dump_config_check(void)
{
	uint8_t mode = 0;

	/* check mode */
	if (exception_config_mode.exception_mode == 0) {
		/* error status, exception_dump_mode should not be 0 */
		exception_config_mode.exception_mode_t.reset_after_dump = TRUE;
		exception_config_mode.exception_mode_t.exception_fulldump_binary = TRUE;
	}

	mode = (uint8_t)(exception_config_mode.exception_mode & 0xff);
	if ((mode != (uint8_t)((exception_config_mode.exception_mode >>  8) & 0xff)) ||
			(mode != (uint8_t)((exception_config_mode.exception_mode >> 16) & 0xff)) ||
			(mode != (uint8_t)((exception_config_mode.exception_mode >> 24) & 0xff))) {
		/* error status, exception_dump_mode should be a 4 Byets-repeated data*/
		exception_config_mode.exception_mode_t.reset_after_dump = TRUE;
		exception_config_mode.exception_mode_t.exception_fulldump_binary = TRUE;
	}
}


/******************************************************************************/
/*            Exception's regitser callbacks Functions                        */
/******************************************************************************/
exception_status_t exception_register_callbacks(exception_config_type *cb)
{
    int i;

    if (exception_config.items >= EXCEPTION_CONFIGURATIONS_MAX) {
        return EXCEPTION_STATUS_ERROR;
    } else {
        /* check if it is already registered */
        for (i = 0; i < exception_config.items; i++) {
            if (exception_config.configs[i].init_cb == cb->init_cb
                    && exception_config.configs[i].dump_cb == cb->dump_cb) {
                return EXCEPTION_STATUS_ERROR;
            }
        }
        exception_config.configs[exception_config.items].init_cb = cb->init_cb;
        exception_config.configs[exception_config.items].dump_cb = cb->dump_cb;
        exception_config.items++;
        return EXCEPTION_STATUS_OK;
    }
}

exception_status_t exception_register_regions(memory_region_type *region)
{
    if (exception_user_regions.items >= EXCEPTION_CONFIGURATIONS_MAX) {
        return EXCEPTION_STATUS_ERROR;
    } else {
        exception_user_regions.regions[exception_user_regions.items].region_name = region->region_name;
        exception_user_regions.regions[exception_user_regions.items].start_address = region->start_address;
        exception_user_regions.regions[exception_user_regions.items].end_address = region->end_address;
        exception_user_regions.regions[exception_user_regions.items].is_dumped = region->is_dumped;
        exception_user_regions.items++;
        return EXCEPTION_STATUS_OK;
    }
}

/******************************************************************************/
/*            Exception's init Functions                                      */
/******************************************************************************/
void exception_init(void)
{
    /*enable unalign access,it will not trap when align access occurs */
    SCB->CCR &= ~SCB_CCR_UNALIGN_TRP_Msk;

#ifdef MTK_BOOTREASON_CHECK_ENABLE
    /* Set assert flag in rtc */
    if (TRUE == ram_assert_flag){
        bootreason_set_flag_assert_reset();
    }
    bootreason_set_flag_exception_reset();
#endif /* MTK_BOOTREASON_CHECK_ENABLE */

    /* enable wdt reset mode for prevent exception flow hang */
    exception_enable_wdt_reset();

