xihua13104/bluekitchen/port/stm32-f4discovery-csr8x11/exception_handler/src/exception_handler.c
                /* feed wdt to keep time for init callback */
                exception_feed_wdt();
                /* run init callback */
                exception_config.configs[i].init_cb();
            }
        }
    }
#endif /* EXCEPTION_MEMDUMP_MODE */

#if (EXCEPTION_MEMDUMP_MODE & EXCEPTION_MEMDUMP_TEXT) || (EXCEPTION_MEMDUMP_MODE & EXCEPTION_MEMDUMP_BINARY)
    if ((exception_config_mode.exception_mode & EXCEPTION_MEMDUMP_TEXT) || (exception_config_mode.exception_mode & EXCEPTION_MEMDUMP_BINARY)) {
        /* Genie complete message */
        exception_printf("<<<<<<<< LOG END LOG END LOG END LOG END LOG END <<<<<<<<\r\n");
    }
#endif

}

void exception_test_handler(void)
{
    exception_printf("<<<<<<<< LOG START LOG START LOG START LOG START LOG START <<<<<<<<\r\n");
}

/******************************************************************************/
/*            Cortex-M4 Processor Exceptions Handlers                         */
/******************************************************************************/
void exception_cm4_fault_handler(uint32_t stack[], uint32_t fault_type)
{

    /* dump exception time, fault type, etc */
    exception_dump_preprocess(fault_type);

    /* dump the context when the exception happens */
    exception_dump_context(stack);

    /* dump the memory */
    exception_dump_memory();

#if (EXCEPTION_SLAVES_TOTAL > 0)
    /* do the slave dump */
    exception_dump_slaves();
#endif /* EXCEPTION_SLAVES_TOTAL */

    /* finish the dump */
    exception_dump_postprocess();

    /* check if reboot */
    if (reboot_check() == DISABLE_WHILELOOP_MAGIC) {
        exception_reboot();
    } else {

        /* disable wdt reset mode for entering while loop */
        /* maybe wdt has been changed to interrupt mode for triggering the NMI interrupt */
        exception_disable_wdt_reset();

#if (defined(AB156X) || (PRODUCT_VERSION == 2822))
        /* it will enable cap touch lpsd and power key */
        pmu_enable_lpsd();
#endif

        //extern void syslog_port_disable_flowcontrol(void);
        //syslog_port_disable_flowcontrol();
        while (1);

    }


}

/******************************************************************************/
/*                   Toolchain Dependent Part                                 */
/******************************************************************************/
#if defined (__CC_ARM)

#define __EXHDLR_ATTR__ __asm ATTR_TEXT_IN_RAM

/**
  * @brief  This function is the common part of exception handlers.
  * @param  r3 holds EXC_RETURN value
  * @retval None
  */
__EXHDLR_ATTR__ void CommonFault_Handler(void)
{
    extern exception_context_pointer
    extern exception_stack_pointer

    PRESERVE8

    mrs r2, primask               /* move primask to r2           */
    cpsid i                       /* disable irq                  */
    ldr r3, = exception_stack_pointer
              ldr r3, [r3]                  /* r3 := exception_stack_pointer       */
              ldr r0, = exception_context_pointer
                        ldr r0, [r0]                  /* r0 := exception_context_pointer      */
                        add r0, r0, #16               /* point to context.r4          */
                        stmia r0!, {r4 - r11}         /* store r4-r11                 */
                        mov r5, r12                   /* r5 := EXC_RETURN             */
                        add r0, r0, #20               /* point to context.control     */
                        mrs r1, control               /* move CONTROL to r1           */
                        str r1, [r0], #4              /* store CONTROL                */
                        str r5, [r0], #4              /* store EXC_RETURN             */
                        mrs r4, msp                   /* r4 := MSP                    */
                        str r4, [r0], #4              /* store MSP                    */
                        mrs r1, psp                   /* move PSP to r1               */
                        str r1, [r0], #4              /* store PSP                    */
                        mrs r1, basepri               /* move basepri to r1           */
                        str r1, [r0], #4              /* store basepri                */
                        mov r1, r2                    /* move primask to r1           */
                        str r1, [r0], #4              /* store primask                */
                        mrs r1, faultmask             /* move faultmask to r1         */
                        str r1, [r0]                  /* store faultmask              */
                        tst r5, #0x10                 /* FPU context?                 */
                        itt eq
                        addeq r0, r0, #68             /* point to contex.s16          */
                        vstmeq r0, {s16 - s31}        /* store s16-s31                */
                        cmp r3, #0                    /* if (!exception_stack_pointer)       */
                        it ne
                        movne sp, r3                  /* update msp                   */
                        push {lr}
                        bl __cpp(exception_init)
                        pop  {lr}
                        tst r5, #4                    /* thread or handler mode?      */
                        ite eq
                        moveq r0, r4
                        mrsne r0, psp
                        bx lr
}

/**
  * @brief  This function handles Hard Fault exception.
  * @param  None
  * @retval None
  */
__EXHDLR_ATTR__ void HardFault_Handler(void)
{
    PRESERVE8

    mov r12, lr
    bl __cpp(CommonFault_Handler)
    mov r1, #3
    bl __cpp(exception_cm4_fault_handler)
}

/**
  * @brief  This function handles Memory Manage exception.
  * @param  None
  * @retval None
  */
__EXHDLR_ATTR__ void MemManage_Handler(void)
{
    PRESERVE8

    mov r12, lr
    bl __cpp(CommonFault_Handler)
    mov r1, #4
    bl __cpp(exception_cm4_fault_handler)
}

/**
  * @brief  This function handles Bus Fault exception.
  * @param  None
  * @retval None
  */
__EXHDLR_ATTR__ void BusFault_Handler(void)
{
    PRESERVE8

    mov r12, lr
    bl __cpp(CommonFault_Handler)
    mov r1, #5
    bl __cpp(exception_cm4_fault_handler)
}

/**
  * @brief  This function handles Usage Fault exception.
  * @param  None
  * @retval None
  */
__EXHDLR_ATTR__ void UsageFault_Handler(void)
{
    PRESERVE8

    mov r12, lr
    bl __cpp(CommonFault_Handler)
    mov r1, #6
    bl __cpp(exception_cm4_fault_handler)
}

#ifdef HAL_DWT_MODULE_ENABLED
__EXHDLR_ATTR__  void DebugMon_Handler(void)
{
    PRESERVE8

    mov r12, lr
    bl __cpp(CommonFault_Handler)
    mov r1, #12
    bl __cpp(exception_cm4_fault_handler)
}
#endif /* HAL_DWT_MODULE_ENABLED */

#endif /* __CC_ARM */

