xihua13104/bluekitchen/port/stm32-f4discovery-csr8x11/exception_handler/src/exception_handler.c
#if defined (__ICCARM__)

#define __EXHDLR_ATTR__  __stackless

ATTR_TEXT_IN_RAM void CommonFault_Handler(void);
ATTR_TEXT_IN_RAM void HardFault_Handler(void);
ATTR_TEXT_IN_RAM void MemManage_Handler(void);
ATTR_TEXT_IN_RAM void BusFault_Handler(void);
ATTR_TEXT_IN_RAM void UsageFault_Handler(void);
ATTR_TEXT_IN_RAM void DebugMon_Handler(void);

/**
  * @brief  This function is the common part of exception handlers.
  * @param  r3 holds EXC_RETURN value
  * @retval None
  */
__EXHDLR_ATTR__ void CommonFault_Handler(void)
{
    __asm volatile
    (
        "mrs r2, primask               \n"     /* move primask to r2          */
        "cpsid i                       \n"     /* disable irq                 */
        "mov r3, %0                    \n"     /* r3 := exception_stack_pointer      */
        "mov r0, %1                    \n"     /* r0 := exception_context_pointer     */
        "add r0, r0, #16               \n"     /* point to context.r4         */
        "stmia r0!, {r4-r11}           \n"     /* store r4-r11                */
        "mov r5, r12                   \n"     /* r5 := EXC_RETURN            */
        "add r0, r0, #20               \n"     /* point to context.control    */
        "mrs r1, control               \n"     /* move CONTROL to r1          */
        "str r1, [r0], #4              \n"     /* store CONTROL               */
        "str r5, [r0], #4              \n"     /* store EXC_RETURN            */
        "mrs r4, msp                   \n"     /* r4 := MSP                   */
        "str r4, [r0], #4              \n"     /* store MSP                   */
        "mrs r1, psp                   \n"     /* move PSP to r1              */
        "str r1, [r0], #4              \n"     /* store PSP                   */
        "mrs r1, basepri               \n"     /* move basepri to r1          */
        "str r1, [r0], #4              \n"     /* store basepri               */
        "mov r1, r2                    \n"     /* move primask to r1          */
        "str r1, [r0], #4              \n"     /* store primask               */
        "mrs r1, faultmask             \n"     /* move faultmask to r1        */
        "str r1, [r0]                  \n"     /* store faultmask             */
        "tst r5, #0x10                 \n"     /* FPU context?                */
        "itt eq                        \n"
        "addeq r0, r0, #68             \n"     /* point to contex.s16         */
        "vstmeq r0, {s16-s31}          \n"     /* store s16-s31               */
        "cmp r3, #0                    \n"     /* if (!exception_stack_pointer)      */
        "it ne                         \n"
        "movne sp, r3                  \n"     /* update msp                  */
        "push {lr}                     \n"
        "bl exception_init             \n"
        "pop {lr}                      \n"
        "tst r5, #4                    \n"     /* thread or handler mode?     */
        "ite eq                        \n"
        "moveq r0, r4                  \n"
        "mrsne r0, psp                 \n"
        "bx lr                         \n"
        ::"r"(exception_stack_pointer), "r"(exception_context_pointer)
    );
}

/**
  * @brief  This function handles Hard Fault exception.
  * @param  None
  * @retval None
  */
__EXHDLR_ATTR__ void HardFault_Handler(void)
{
    __asm volatile
    (
        "mov r12, lr                   \n"
        "bl CommonFault_Handler        \n"
        "mov r1, #3                    \n"
        "bl exception_cm4_fault_handler\n"
    );
}

/**
  * @brief  This function handles Memory Manage exception.
  * @param  None
  * @retval None
  */
__EXHDLR_ATTR__ void MemManage_Handler(void)
{
    __asm volatile
    (
        "mov r12, lr                   \n"
        "bl CommonFault_Handler        \n"
        "mov r1, #4                    \n"
        "bl exception_cm4_fault_handler\n"
    );
}

/**
  * @brief  This function handles Bus Fault exception.
  * @param  None
  * @retval None
  */
__EXHDLR_ATTR__ void BusFault_Handler(void)
{
    __asm volatile
    (
        "mov r12, lr                   \n"
        "bl CommonFault_Handler        \n"
        "mov r1, #5                    \n"
        "bl exception_cm4_fault_handler\n"
    );
}

/**
  * @brief  This function handles Usage Fault exception.
  * @param  None
  * @retval None
  */
__EXHDLR_ATTR__ void UsageFault_Handler(void)
{
    __asm volatile
    (
        "mov r12, lr                   \n"
        "bl CommonFault_Handler        \n"
        "mov r1, #6                    \n"
        "bl exception_cm4_fault_handler\n"
    );
}

#ifdef HAL_DWT_MODULE_ENABLED
__EXHDLR_ATTR__  void DebugMon_Handler(void)
{
    __asm volatile
    (
        "mov r12, lr                   \n"
        "bl CommonFault_Handler        \n"
        "mov r1, #12                   \n"
        "bl exception_cm4_fault_handler\n"
    );
}
#endif /* HAL_DWT_MODULE_ENABLED */

#endif /* __ICCARM__ */
